Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/atdf/ATSAMS70J20B.atdf
        <register caption="Host Pipe Error Register (n = 0) 0" name="USBHS_HSTPIPERR" offset="0x680" rw="RW" size="4" count="10">
          <bitfield caption="Data Toggle Error" mask="0x00000001" name="DATATGL"/>
          <bitfield caption="Data PID Error" mask="0x00000002" name="DATAPID"/>
          <bitfield caption="Data PID Error" mask="0x00000004" name="PID"/>
          <bitfield caption="Time-Out Error" mask="0x00000008" name="TIMEOUT"/>
          <bitfield caption="CRC16 Error" mask="0x00000010" name="CRC16"/>
          <bitfield caption="Error Counter" mask="0x00000060" name="COUNTER"/>
        </register>
        <register-group caption="Host DMA Channel Next Descriptor Address Register (n = 1)" offset="0x710" name="USBHS_HSTDMA" size="16" count="7" name-in-module="USBHS_HSTDMA"/>
        <register caption="General Control Register" name="USBHS_CTRL" offset="0x0800" rw="RW" size="4">
          <bitfield caption="Remote Device Connection Error Interrupt Enable" mask="0x00000010" name="RDERRE"/>
          <bitfield caption="VBUS Hardware Control" mask="0x00000100" name="VBUSHWC"/>
          <bitfield caption="Freeze USB Clock" mask="0x00004000" name="FRZCLK"/>
          <bitfield caption="USBHS Enable" mask="0x00008000" name="USBE"/>
          <bitfield caption="USBHS Mode" mask="0x02000000" name="UIMOD" values="USBHS_CTRL__UIMOD"/>
        </register>
        <register caption="General Status Register" name="USBHS_SR" offset="0x0804" rw="R" size="4">
          <bitfield caption="Remote Device Connection Error Interrupt (Host mode only)" mask="0x00000010" name="RDERRI"/>
          <bitfield caption="Speed Status (Device mode only)" mask="0x00003000" name="SPEED" values="USBHS_SR__SPEED"/>
          <bitfield caption="UTMI Clock Usable" mask="0x00004000" name="CLKUSABLE"/>
        </register>
        <register caption="General Status Clear Register" name="USBHS_SCR" offset="0x0808" rw="W" size="4" atomic-op="clear:USBHS_SR">
          <bitfield caption="Remote Device Connection Error Interrupt Clear" mask="0x00000010" name="RDERRIC"/>
        </register>
        <register caption="General Status Set Register" name="USBHS_SFR" offset="0x080C" rw="W" size="4" atomic-op="set:USBHS_SR">
          <bitfield caption="Remote Device Connection Error Interrupt Set" mask="0x00000010" name="RDERRIS"/>
          <bitfield caption="VBUS Request Set" mask="0x00000200" name="VBUSRQS"/>
        </register>
      </register-group>
      <value-group caption="" name="USBHS_DEVCTRL__SPDCONF">
        <value caption="The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable." name="NORMAL" value="0"/>
        <value caption="For a better consumption, if high speed is not needed." name="LOW_POWER" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__NBTRANS">
        <value caption="Reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="Default value: one transaction per microframe." name="_1_TRANS" value="0x1"/>
        <value caption="Two transactions per microframe. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="Three transactions per microframe. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTISR__DTSEQ">
        <value caption="Data0 toggle sequence" name="DATA0" value="0x0"/>
        <value caption="Data1 toggle sequence" name="DATA1" value="0x1"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="DATA2" value="0x2"/>
        <value caption="Reserved for high-bandwidth isochronous endpoint" name="MDATA" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTISR__NBUSYBK">
        <value caption="0 busy bank (all banks free)" name="_0_BUSY" value="0x0"/>
        <value caption="1 busy bank" name="_1_BUSY" value="0x1"/>
        <value caption="2 busy banks" name="_2_BUSY" value="0x2"/>
        <value caption="3 busy banks" name="_3_BUSY" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTISR__CURRBK">
        <value caption="Current bank is bank0" name="BANK0" value="0x0"/>
        <value caption="Current bank is bank1" name="BANK1" value="0x1"/>
        <value caption="Current bank is bank2" name="BANK2" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_HSTCTRL__SPDCONF">
        <value caption="The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable." name="NORMAL" value="0"/>
        <value caption="For a better consumption, if high speed is not needed." name="LOW_POWER" value="1"/>
      </value-group>
