Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/atdf/ATSAMS70J20B.atdf
        <register offset="0x00000004" size="4" name="MPU_CTRL" initval="0x00000000" caption="MPU Control Register" rw="RW">
          <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
          <bitfield mask="0x00000002" name="HFNMIENA" caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
          <bitfield mask="0x00000004" name="PRIVDEFENA" caption="Enables privileged software access to the default memory map."/>
        </register>
        <register offset="0x00000008" size="4" name="MPU_RNR" caption="MPU Region Number Register" rw="RW">
          <bitfield mask="0x000000FF" name="REGION" caption="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers."/>
        </register>
        <register offset="0x0000000C" size="4" name="MPU_RBAR" caption="MPU Region Base Address Register" rw="RW">
          <bitfield mask="0x0000000F" name="REGION" caption="MPU region field."/>
          <bitfield mask="0x00000010" name="VALID" caption="MPU Region Number valid bit."/>
          <bitfield mask="0xFFFFFFE0" name="ADDR" caption="Region base address field."/>
        </register>
        <register offset="0x00000010" size="4" name="MPU_RASR" caption="MPU Region Attribute and Size Register" rw="RW">
          <bitfield mask="0x00000001" name="ENABLE" caption="Region enable bit."/>
          <bitfield mask="0x0000003E" name="SIZE" caption="Specifies the size of the MPU protection region."/>
          <bitfield mask="0x0000FF00" name="SRD" caption="Subregion disable bits."/>
          <bitfield mask="0x00010000" name="B" caption="MPU access permission attributes."/>
          <bitfield mask="0x00020000" name="C" caption="MPU access permission attributes."/>
          <bitfield mask="0x00040000" name="S" caption="Shareable bit."/>
          <bitfield mask="0x00380000" name="TEX" caption="MPU access permission attributes."/>
          <bitfield mask="0x07000000" name="AP" caption="Access permission field."/>
          <bitfield mask="0x10000000" name="XN" caption="Instruction access disable bit."/>
        </register>
      </register-group>
    </module>
    <module name="FPU" caption="Floating Point Unit Registers">
      <register-group name="FPU" caption="Floating Point Unit">
        <register offset="0x00000000" size="4" name="FPCCR" initval="0xC0000000" caption="Floating-point Context Control Register">
          <bitfield mask="0x00000001" name="LSPACT" caption="Lazy state preservation is active. Floating-point stack frame has been allocated but saving state to it has been deferred."/>
          <bitfield mask="0x00000002" name="USER" caption="Privilege level was user when the floating-point stack frame was allocated."/>
          <bitfield mask="0x00000008" name="THREAD" caption="Mode was Thread Mode when the floating-point stack frame was allocated."/>
          <bitfield mask="0x00000010" name="HFRDY" caption="Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated."/>
          <bitfield mask="0x00000020" name="MMRDY" caption="MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated."/>
          <bitfield mask="0x00000040" name="BFRDY" caption="BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated."/>
          <bitfield mask="0x00000100" name="MONRDY" caption="DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated."/>
          <bitfield mask="0x40000000" name="LSPEN" caption="Enable automatic lazy state preservation for floating-point context."/>
          <bitfield mask="0x80000000" name="ASPEN" caption="Enables CONTROL.FPCA setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit."/>
        </register>
        <register offset="0x00000004" size="4" name="FPCAR" caption="Floating-point Context Address Register">
          <bitfield mask="0xFFFFFFF8" name="ADDRESS" caption="The location of the unpopulated floating-point register space allocated on an exception stack frame."/>
        </register>
        <register offset="0x00000008" size="4" name="FPDSCR" initval="0x00000000" caption="Floating-point Default Status Control Register">
          <bitfield mask="0x00C00000" name="RMode" caption="Default value for FPSCR.RMode."/>
          <bitfield mask="0x01000000" name="FZ" caption="Default value for FPSCR.FZ."/>
          <bitfield mask="0x02000000" name="DN" caption="Default value for FPSCR.DN."/>
          <bitfield mask="0x04000000" name="AHP" caption="Default value for FPSCR.AHP."/>
        </register>
      </register-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="LQFP64">
      <pin position="40" pad="PA3"/>
      <pin position="34" pad="PA4"/>
      <pin position="32" pad="PA5"/>
      <pin position="15" pad="PA7"/>
      <pin position="16" pad="PA8"/>
      <pin position="33" pad="PA9"/>
      <pin position="28" pad="PA10"/>
      <pin position="27" pad="PA11"/>
      <pin position="29" pad="PA12"/>
      <pin position="18" pad="PA13"/>
      <pin position="19" pad="PA14"/>
      <pin position="12" pad="PA21"/>
      <pin position="17" pad="PA22"/>
      <pin position="23" pad="PA24"/>
      <pin position="30" pad="PA27"/>
      <pin position="8" pad="PB0"/>
      <pin position="7" pad="PB1"/>
      <pin position="9" pad="PB2"/>
      <pin position="11" pad="PB3"/>
      <pin position="46" pad="PB4"/>
      <pin position="47" pad="PB5"/>
      <pin position="35" pad="PB6"/>
      <pin position="39" pad="PB7"/>
      <pin position="62" pad="PB8"/>
      <pin position="63" pad="PB9"/>
      <pin position="38" pad="PB12"/>
      <pin position="1" pad="PD0"/>
      <pin position="57" pad="PD1"/>
      <pin position="56" pad="PD2"/>
      <pin position="55" pad="PD3"/>
      <pin position="54" pad="PD4"/>
      <pin position="53" pad="PD5"/>
      <pin position="51" pad="PD6"/>
      <pin position="50" pad="PD7"/>
      <pin position="49" pad="PD8"/>
      <pin position="48" pad="PD9"/>
      <pin position="44" pad="PD10"/>
      <pin position="43" pad="PD11"/>
      <pin position="41" pad="PD12"/>
      <pin position="26" pad="PD21"/>
      <pin position="25" pad="PD22"/>
      <pin position="22" pad="PD24"/>
      <pin position="20" pad="PD25"/>
      <pin position="21" pad="PD26"/>
      <pin position="2" pad="PD31"/>
      <pin position="3" pad="VDDOUT"/>
      <pin position="4" pad="VDDIN"/>
      <pin position="5" pad="VREFP"/>
      <pin position="36" pad="NRST"/>
      <pin position="37" pad="TST"/>
      <pin position="10" pad="VDDIO"/>
      <pin position="42" pad="VDDIO"/>
      <pin position="58" pad="VDDIO"/>
      <pin position="45" pad="JTAGSEL"/>
      <pin position="13" pad="VDDCORE"/>
      <pin position="24" pad="VDDCORE"/>
      <pin position="61" pad="VDDCORE"/>
      <pin position="52" pad="VDDPLL"/>
      <pin position="59" pad="DM"/>
      <pin position="60" pad="DP"/>
      <pin position="6" pad="GND"/>
      <pin position="14" pad="GND"/>
      <pin position="31" pad="GND"/>
      <pin position="64" pad="VDDPLLUSB"/>
    </pinout>
    <pinout name="QFN64">
      <pin position="40" pad="PA3"/>
      <pin position="34" pad="PA4"/>
      <pin position="32" pad="PA5"/>
      <pin position="15" pad="PA7"/>
      <pin position="16" pad="PA8"/>
      <pin position="33" pad="PA9"/>
      <pin position="28" pad="PA10"/>
      <pin position="27" pad="PA11"/>
      <pin position="29" pad="PA12"/>
      <pin position="18" pad="PA13"/>
      <pin position="19" pad="PA14"/>
      <pin position="12" pad="PA21"/>
      <pin position="17" pad="PA22"/>
      <pin position="23" pad="PA24"/>
      <pin position="30" pad="PA27"/>
      <pin position="8" pad="PB0"/>
      <pin position="7" pad="PB1"/>
      <pin position="9" pad="PB2"/>
      <pin position="11" pad="PB3"/>
      <pin position="46" pad="PB4"/>
      <pin position="47" pad="PB5"/>
      <pin position="35" pad="PB6"/>
      <pin position="39" pad="PB7"/>
      <pin position="63" pad="PB8"/>
      <pin position="64" pad="PB9"/>
      <pin position="38" pad="PB12"/>
      <pin position="2" pad="PD0"/>
      <pin position="57" pad="PD1"/>
      <pin position="56" pad="PD2"/>
      <pin position="55" pad="PD3"/>
      <pin position="54" pad="PD4"/>
      <pin position="53" pad="PD5"/>
      <pin position="51" pad="PD6"/>
      <pin position="50" pad="PD7"/>
      <pin position="49" pad="PD8"/>
      <pin position="48" pad="PD9"/>
      <pin position="44" pad="PD10"/>
      <pin position="43" pad="PD11"/>
      <pin position="41" pad="PD12"/>
      <pin position="26" pad="PD21"/>
      <pin position="25" pad="PD22"/>
      <pin position="22" pad="PD24"/>
      <pin position="20" pad="PD25"/>
      <pin position="21" pad="PD26"/>
      <pin position="3" pad="PD31"/>
      <pin position="4" pad="VDDOUT"/>
      <pin position="5" pad="VDDIN"/>
      <pin position="6" pad="VREFP"/>
      <pin position="36" pad="NRST"/>
      <pin position="37" pad="TST"/>
      <pin position="10" pad="VDDIO"/>
      <pin position="42" pad="VDDIO"/>
      <pin position="58" pad="VDDIO"/>
      <pin position="45" pad="JTAGSEL"/>
      <pin position="13" pad="VDDCORE"/>
      <pin position="24" pad="VDDCORE"/>
      <pin position="61" pad="VDDCORE"/>
      <pin position="52" pad="VDDPLL"/>
      <pin position="59" pad="DM"/>
      <pin position="60" pad="DP"/>
      <pin position="14" pad="GND"/>
      <pin position="31" pad="GND"/>
      <pin position="1" pad="VDDPLLUSB"/>
      <pin position="62" pad="VBG"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
